public class Main {

    public static void main (String[] args) {

        System.out.println(format("Гуляев Гавриил Парфеньевич"));

    }

    public static String format(String a){

        return a;
    }


}

/**
 * Напишите метод который принимает ФИО и выводит на экран "Фамилия Имя"
 * Пример:
 * 	format("Гуляев Гавриил Парфеньевич"); // выведет на экран "Гуляев Гавриил"
 */
